/*芬芬时尚潮流*/
var status = -1;
var maps = Array(
910001000, //隐藏地图 - 专业技术村庄&lt;匠人街>
100000000, //射手村
104000000, //明珠港
102000000, //勇士部落
101000000,  //魔法密林
103000000,  //废弃都市
104000000, //明珠港
101050000, //埃欧雷
120000000,  //诺特勒斯
105000000,  //林中之城
120030000,  //黄金海滩
106020000, //蘑菇城堡
130000000,//圣地
140000000,//里恩
230000000,//水下世界
230050000,//维利塔斯
220000000, //玩具城
300000000, //艾琳森林
221000000,//地球防御本部
222000000, //童话村
240000000, //神木村
270000100,//时间神殿
271000000,//未来之门
260000000,//阿里安特
262000000,//阿斯旺避难处
261000000,//玛加提亚
540000000,//中心商务区
541020000,//乌鲁城
250000000, //武陵
251000000, //百草堂
211000000, //冰峰雪域
200000000, //天空之城
310000000, //埃德尔斯坦
802000101, //逆奥之城
801000000, //昭和村
541000000, //驳船码头城
551000000, //甘榜村
550000000, //吉隆大都市 
682000000, //闹鬼宅邸外部
555000000, //白色圣诞山丘
200100000, //克里塞入口
211060000, //沉寂原野
310040300, //岩石路
600000000, //被破坏的新叶城
701000000);//上海外滩

var monstermaps = Array(
										Array(50000,0,"大蘑菇								1级-10级"),
                                                                                Array(100010000,0,"射手村北部小山		      	        1级-10级"),
                                                                                Array(100040000,0,"石人寺院入口		      	        1级-30级"),
                                                                                Array(310030110,0,"蛇出没之路			      	        1级-30级"),
                                                                                Array(310030310,0,"路灯小道			      	        1级-30级"),
                                                                                Array(310030300,0,"埃德尔斯坦散步路4		  	        1级-30级"),
                                                                                Array(310040000,0,"通往矿山的路1		      	        1级-30级"),
                                                                                Array(310040100,0,"通往矿山的路2		      	        1级-30级"),
                                                                                Array(310040300,0,"岩石路				      	        1级-30级"),
                                                                                Array(310040400,0,"矿石路				      	        1级-30级"),
										Array
(220010500,0,"露台大厅			      	        30级-70级"),
										Array
(220020300,0,"玩具工厂<骨干工程1>	      	        30级-70级"),
										Array(220030200,0,"玩具工厂<骨干工程2>			        30级-70级"),
										Array(220040100,0,"时间之路<2>			   		        30级-70级"),
										Array(220050000,0,"丢失的时间<1>		      	        30级-70级"),
										Array(260020700,0,"沙哈地带1			      	        30级-70级"),
										Array(260020610,0,"沉睡的沙漠			      	        30级-70级"),
										Array(260010700,0,"阿里安特东门外		      	        30级-70级"),
										Array(550000400,0,"泥泞的河岸3			      	        30级-70级"),
										Array(551000200,0,"大红花路2			      	        30级-70级"),
										Array(310050600,0,"坑道2				      	        70级-120级"),
										Array(310060100,0,"机器人研究所1		      	        70级-120级"),
										Array
(310050510,0,"狸猫巢穴			      	        70级-120级"),
										Array
(310060200,0,"防御系统研究所1		   	   		    70级-120级"),
										Array
(240011000,0,"神木村东边森林		      	        70级-120级"),
										Array
(240010000,0,"神木村西边森林		      	        70级-120级"),
										Array
(240020400,0,"寒冰半人马领土		      	        70级-120级"),
										Array
(240010700,0,"天空之巢I			      	        70级-120级"),
										Array
(240030000,0,"龙林入口			      	        120级-150级"),
										Array
(240030101,0,"火焰树林			      	        120级-150级"),
										Array
(211060100,0,"城墙下1			       	  	     	120级-150级"),
										Array
(211060410,0,"矮城墙1			      	        	120级-150级"),
										Array
(211060620,0,"高城墙1			      	  	        120级-150级"),
										Array
(240030102,0,"消失的树林			      	        120级-150级"),
										Array
(240030103,0,"被隐藏的龙庙1		      	        120级-150级"),
										Array
(240040000,0,"龙的峡谷			      	        120级-150级"),
										Array
(240040400,0,"飞龙的峡谷			      	        120级-150级"),
										Array
(240040500,0,"龙之巢穴入口			            120级-150级"),
										Array
(240040511,0,"被遗忘的龙之巢穴			        120级-150级"),
										Array
(271010100,0,"破坏的射手村市场			      	150级-170级"),
										Array
(271010301,0,"奇怪的山丘			      	        150级-170级"),
										Array
(271030100,0,"骑士团第1区域				        150级-170级"),
										Array
(270010300,0,"追忆之路3			      	        150级-170级"),
										Array
(270020500,0,"后悔之路5			      	        150级-170级"),
										Array
(270030500,0,"忘却之路5			      	        150级-170级"),
										Array
(271030310,0,"武器库1				      	        170级-200级"),
										Array
(271030500,0,"骑士团殿堂1			      	        170级-200级"),
										Array
(271030600,0,"荣誉殿堂			      	        170级-200级"),
										Array
(271030201,0,"精灵之地			      	        170级-200级")
										); 

var bossmaps = Array( 
100020401,//僵尸蘑菇的巢穴-僵尸王
100020301,//蓝蘑菇王的森林-蓝蘑菇王
100020101,//蘑菇王小道-蘑菇王  
230040420,//皮亚奴斯洞穴-鱼王
220080000,//时间塔的本源-闹钟
240020402,//喷火龙栖息地-喷火龙
240020102,//格瑞芬的森林-格瑞芬   
551030100,//阴森世界-狮子-熊
240040700,//暗黑龙王栖息地-黑龙
541020700,//克雷塞尔遗迹-大树王
270050000,//忘却的黄昏-品宾克
271040000,//希纳斯的庭院-女皇
200101400,//进入角斗场内部-克
211070000,//接见室走廊
703020000,//外星人底下钻探区 入口
702070400);//藏经主场

var selectedMap = -1;
var selectedArea = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 2 || status == 0) {
            cm.dispose();
            return;
        }
        status--;
    }

    if (status == 0) {
        cm.sendSimple("您好 #r#h ##k 请选择您要传送的项目:\r\n#b#L0#城镇传送#l\r\n#L1#练级传送#l\r\n#L4#BOSS传送#l#k\r\n#L5#美洲豹栖息地(抓豹子)#l");
    } else if (status == 1) {
	var selStr = "请选择您的目的地: #b";
    	if (selection == 0) {
            	for (var i = 0; i < maps.length; i++) {
                	selStr += "\r\n#L" + i + "##m" + maps[i] + "# #l";
            	}
        } else if (selection == 2) {
            	cm.dispose();
            	cm.openNpc(9010022);
            	return;
        } else if (selection == 3) {
            	cm.dispose();
            	cm.openNpc(9070007);
            	return;
	} else if (selection == 4) {
		for (var i = 0; i < bossmaps.length; i++) {
                	selStr += "\r\n#L" + i + "##m" + bossmaps[i] + "# #l";
            	}
	} else if (selection == 5) {
		if(cm.getJob() >= 3300 && cm.getJob() <= 3312){
			cm.teachSkill(24000003, 1, 1);
			cm.warp(931000500,0);
			cm.dispose();
			return;
		}else {
			cm.sendOk("你需要抓豹子?");
			cm.dispose();
		}
		
		
        } else {
                       for (var i = 0; i < monstermaps.length; i++) {
				selStr += "\r\n#L" + i + "#" + monstermaps[i][2] + "";
                       }
	} 
        selectedArea = selection;
        cm.sendSimple(selStr);
    } else if (status == 2) {
        //cm.sendYesNo("看来这里的事情都已经处理完了啊。您真的要移动到 #m" + (selectedArea == 0 ? maps[selection] : monstermaps[selection]) + "# 吗？");
	cm.sendYesNo("看来这里的事情都已经处理完了啊。您真的要移动吗？");
        selectedMap = selection;
    } else if (status == 3) {
        if (selectedMap >= 0) {
		if(selectedArea == 0){
			cm.warp(maps[selectedMap],0);
		}else if(selectedArea == 4){
			cm.warp(bossmaps[selectedMap],0);
		}else{
			cm.warp(monstermaps[selectedMap][0],0);
		}
            //cm.warp(selectedArea == 0 ? maps[selectedMap] : monstermaps[selectedMap], 0);
        }
        cm.dispose();
    } else if (status == 6) {
        
    }
}